Terraform Format and Style 💄`success`
Terraform Initialization ⚙️`success`
Terraform Plan 📖`success`
Terraform Validation 👀`success`

<details><summary>Show Plan</summary>

```terraform

data.azurerm_resource_group.typesense_resource_group: Reading...
data.azurerm_resource_group.typesense_resource_group: Read complete after 0s [id=/subscriptions/2f98793b-7e2f-4f03-ac5b-7b2ec934dcd7/resourceGroups/typesense-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.typesense_container_app will be created
  + resource "azurerm_container_app" "typesense_container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "typesense-container-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "typesense-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8108
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = "one"

          + container {
              + args              = []
              + command           = []
              + cpu               = 1
              + ephemeral_storage = (known after apply)
              + image             = "docker.io/typesense/typesense:0.24.0"
              + memory            = "2Gi"
              + name              = "typesense-acm-website"

              + env {
                  + name  = "TYPESENSE_DATA_DIR"
                  + value = "/data"
                }
              + env {
                  + name        = "TYPESENSE_API_KEY"
                  + secret_name = "api-key"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 10
                  + interval_seconds                 = 10
                  + path                             = "/health"
                  + port                             = 8108
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 1
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + interval_seconds        = 10
                  + path                    = "/health"
                  + port                    = 8108
                  + success_count_threshold = 3
                  + timeout                 = 1
                  + transport               = "HTTP"
                }

              + volume_mounts {
                  + name = "typesense-volume"
                  + path = "/data"
                }
            }

          + volume {
              + name         = "typesense-volume"
              + storage_name = "typesense-container-app-storage"
              + storage_type = "AzureFile"
            }
        }
    }

  # azurerm_container_app_environment.typesense_container_app_env will be created
  + resource "azurerm_container_app_environment" "typesense_container_app_env" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "northcentralus"
      + log_analytics_workspace_id       = (known after apply)
      + name                             = "typesense-container-app-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "typesense-rg"
      + static_ip_address                = (known after apply)
    }

  # azurerm_container_app_environment_storage.typesense_container_app_env_storage will be created
  + resource "azurerm_container_app_environment_storage" "typesense_container_app_env_storage" {
      + access_key                   = (sensitive value)
      + access_mode                  = "ReadWrite"
      + account_name                 = "typesensestorage"
      + container_app_environment_id = (known after apply)
      + id                           = (known after apply)
      + name                         = "typesense-container-app-storage"
      + share_name                   = "typesense-share"
    }

  # azurerm_log_analytics_workspace.typesense_log_workspace will be created
  + resource "azurerm_log_analytics_workspace" "typesense_log_workspace" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "northcentralus"
      + name                               = "typesense-logs"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "typesense-rg"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + workspace_id                       = (known after apply)
    }

  # azurerm_storage_account.typesense_storage_account will be created
  + resource "azurerm_storage_account" "typesense_storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "FileStorage"
      + account_replication_type          = "LRS"
      + account_tier                      = "Premium"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "northcentralus"
      + min_tls_version                   = "TLS1_2"
      + name                              = "typesensestorage"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "typesense-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
    }

  # azurerm_storage_share.typesense_storage_share will be created
  + resource "azurerm_storage_share" "typesense_storage_share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "typesense-share"
      + quota                = 100
      + resource_manager_id  = (known after apply)
      + storage_account_name = "typesensestorage"
      + url                  = (known after apply)
    }

  # shell_sensitive_script.github_secret_typesense_host will be created
  + resource "shell_sensitive_script" "github_secret_typesense_host" {
      + dirty                 = false
      + environment           = (known after apply)
      + id                    = (known after apply)
      + output                = (sensitive value)
      + sensitive_environment = (sensitive value)
      + triggers              = (known after apply)
      + working_directory     = "."

      + lifecycle_commands {
          + create = <<-EOT
                gh secret set TYPESENSE_HOST \
                  -R acm-uic/acm-uic.github.io \
                  -b $TYPESENSE_HOST
            EOT
          + delete = <<-EOT
                gh secret remove TYPESENSE_HOST \
                  -R acm-uic/acm-uic.github.io
            EOT
        }
    }

  # shell_sensitive_script.github_secret_typesense_search_only_api_key will be created
  + resource "shell_sensitive_script" "github_secret_typesense_search_only_api_key" {
      + dirty                 = false
      + environment           = {
          + "REPO" = "acm-uic.github.io"
        }
      + id                    = (known after apply)
      + output                = (sensitive value)
      + sensitive_environment = (sensitive value)
      + triggers              = (known after apply)
      + working_directory     = "."

      + lifecycle_commands {
          + create = <<-EOT
                gh secret set TYPESENSE_SEARCH_ONLY_API_KEY -b $TYPESENSE_SEARCH_ONLY_API_KEY -R acm-uic/acm-uic.github.io
            EOT
          + delete = <<-EOT
                gh secret remove TYPESENSE_SEARCH_ONLY_API_KEY -R acm-uic/acm-uic.github.io
            EOT
        }
    }

  # shell_sensitive_script.typesense_search_only_api_key will be created
  + resource "shell_sensitive_script" "typesense_search_only_api_key" {
      + dirty                 = false
      + environment           = (known after apply)
      + id                    = (known after apply)
      + output                = (sensitive value)
      + sensitive_environment = (sensitive value)
      + triggers              = {
          + "when_value_changed" = (sensitive value)
        }
      + working_directory     = "."

      + lifecycle_commands {
          + create = <<-EOT
                until curl --silent "https://$TYPESENSE_HOST/health" | grep -q '"ok":true'; do sleep 5; done;
                curl --silent "https://$TYPESENSE_HOST/keys" \
                  -X POST \
                  -H "X-TYPESENSE-API-KEY: $TYPESENSE_API_KEY" \
                  -H 'Content-Type: application/json' \
                  -d "{\"description\":\"search-only-api-key-$COLLECTION_NAME\",\"actions\": [\"documents:search\"], \"collections\": [\"$COLLECTION_NAME\"]}" \
                  | jq '{id, value}'
            EOT
          + delete = <<-EOT
                IN=$(cat)
                ID=$(echo $IN | jq -r .id)
                until curl --silent "https://$TYPESENSE_HOST/health" | grep -q '"ok":true'; do sleep 5; done;
                curl --silent "https://$TYPESENSE_HOST/keys/$ID" \
                  -X DELETE \
                  -H "X-TYPESENSE-API-KEY: $TYPESENSE_API_KEY"
            EOT
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + typesense_container_app_fqdn  = (known after apply)
  + typesense_search_only_api_key = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @bmiddha, Action: `pull_request`*